[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for _cfx_internal
[38;5;73m[ citizen-server-impl] [0m[0m[32mScanning resources.[0m
[38;5;163m[    c-resources-core] [0m[0mResource loading for node_modules failed:
[38;5;163m[    c-resources-core] [0m[0mCould not open resource metadata file - no such file.
[38;5;73m[ citizen-server-impl] [0m[0m[32mFound 28 resources.[0m
[38;5;66m[          svadhesive] [0m[0mAuthenticating server license key...
[38;5;66m[          svadhesive] [0m[0mServer license key authentication succeeded. Welcome!
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for yarn
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource yarn
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for sessionmanager-rdr3
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource sessionmanager-rdr3
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for oxmysql
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource oxmysql
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource spawnmanager
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mapmanager
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mapmanager
[38;5;154m[   script:mapmanager] [0m[0mStarted gametype Freeroam
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource basic-gamemode
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;66m[script:mkframe-conne] [0m[0mError parsing script @mkframe-connect/server.js in resource mkframe-connect: SyntaxError: Cannot use import statement outside a module
[38;5;161m[    c-scripting-core] [0m[0mFailed to load script server.js.
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;154m[   script:mapmanager] [0m[0mStarted map redm-map-one
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource redm-map-one
[38;5;42m[      script:oxmysql] [0m[0m[32mDatabase server connection established![97m
[38;5;73m[ citizen-server-impl] [0m[97m[91m        fff                          
[38;5;73m[ citizen-server-impl] [0m[91m[91m  cccc ff   xx  xx     rr rr    eee  
[38;5;73m[ citizen-server-impl] [0m[91m[91mcc     ffff   xx       rrr  r ee   e 
[38;5;73m[ citizen-server-impl] [0m[91m[91mcc     ff     xx   ... rr     eeeee  
[38;5;73m[ citizen-server-impl] [0m[91m[91m ccccc ff   xx  xx ... rr      eeeee 
[38;5;73m[ citizen-server-impl] [0m[91m                                     [0m
[38;5;73m[ citizen-server-impl] [0m[0m[32mAuthenticated with cfx.re Nucleus: [0mhttps://rzakx-b9le4d.users.cfx.re/
[6G[J[0;1;35mr[0m[0;1;30mateLimiter_http_info_burst[0m[7G[6G[J[0;1;35mre[0m[0;1;30mfresh[0m[8G[6G[J[0;1;35mref[0m[0;1;30mresh[0m[9G[6G[J[0;1;35mrefr[0m[0;1;30mesh[0m[10G[6G[J[0;1;35mrefre[0m[0;1;30msh[0m[11G[6G[J[0;1;35mrefres[0m[0;1;30mh[0m[12G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mrefresh[0m[13G
[38;5;73m[ citizen-server-impl] [0m[0m[32mScanning resources.[0m
[38;5;163m[    c-resources-core] [0m[0mResource loading for node_modules failed:
[38;5;163m[    c-resources-core] [0m[0mCould not open resource metadata file - no such file.
[38;5;73m[ citizen-server-impl] [0m[0m[32mFound 1 new resources, and refreshed 0/27 resources.[0m
cfx> [6G[J[0;1;35me[0m[0;1;30mndpoint_add_tcp[0m[7G[6G[J[0;1;35men[0m[0;1;30mdpoint_add_tcp[0m[8G[6G[J[0;1;35mens[0m[0;1;30mure[0m[9G[6G[J[0;1;35mensu[0m[0;1;30mre[0m[10G[6G[J[0;1;35mensur[0m[0;1;30me[0m[11G[6G[J[0;1;35mensure[0m[12G[6G[J[0;1;35mensure[0m [0m[0;1;30mbaseevents[0m[13G[6G[J[0;1;35mensure[0m m[0m[0;1;30mapmanager[0m[14G[6G[J[0;1;35mensure[0m mk[0m[0;1;30mframe-connect[0m[15G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mRafal nie ma Steama.
[38;5;66m[script:mkframe-conne] [0m[0mRafal nie ma Steama.
[38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mr[0m[0;1;30mateLimiter_http_info_burst[0m[7G[6G[J[0;1;35mre[0m[0;1;30mfresh[0m[8G[6G[J[0;1;35mres[0m[0;1;30mtart[0m[9G[6G[J[0;1;35mrest[0m[0;1;30mart[0m[10G[6G[J[0;1;35mresta[0m[0;1;30mrt[0m[11G[6G[J[0;1;35mrestar[0m[0;1;30mt[0m[12G[6G[J[0;1;35mrestart[0m[13G[6G[J[0;1;35mrestart[0m [0m[0;1;30mbaseevents[0m[14G[6G[J[0;1;35mrestart[0m m[0m[0;1;30mapmanager[0m[15G[6G[J[0;1;35mrestart[0m mk[0m[0;1;30mframe-connect[0m[16G[6G[J[0;1;35mrestart[0m mkf[0m[0;1;30mrame-connect[0m[17G[6G[J[0;1;35mrestart[0m mkfr[0m[0;1;30mame-connect[0m[18G[6G[J[0;1;35mrestart[0m mkframe-connect[0m[29G[6G[J[0;1;35mrestart[0m mkframe-connect[0m[29G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mrestart[0m mkframe-connect[0m[29G[6G[J[0;1;35mrestart[0m mkframe-connect[0m[29G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [6G[J[0;1;35mrestart[0m mkframe-connect[0m[29G[6G[J[0;1;35mrestart[0m mkframe-connect[0m[29G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35me[0m[0;1;30mndpoint_add_tcp[0m[7G[6G[J[0;1;35men[0m[0;1;30mdpoint_add_tcp[0m[8G[6G[J[0;1;35mens[0m[0;1;30mure[0m[9G[6G[J[0;1;35mensu[0m[0;1;30mre[0m[10G[6G[J[0;1;35mensur[0m[0;1;30me[0m[11G[6G[J[0;1;35mensure[0m[12G[6G[J[0;1;35mensure[0m [0m[0;1;30mbaseevents[0m[13G[6G[J[0;1;35mensure[0m o[0m[0;1;30mxmysql[0m[14G[6G[J[0;1;35mensure[0m ox[0m[0;1;30mmysql[0m[15G[6G[J[0;1;35mensure[0m oxmysql[0m[20G[6G[J[0;1;35mensure[0m oxmysql[0m[20G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource oxmysql
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for oxmysql
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource oxmysql
cfx> [38;5;73m[ citizen-server-impl] [0m[0mserver thread hitch warning: timer interval of 301 milliseconds
[38;5;42m[      script:oxmysql] [0m[0m[32mDatabase server connection established![97m
[6G[J[0;1;35me[0m[0;1;30mndpoint_add_tcp[0m[7G[6G[J[0;1;35mex[0m[0;1;30mec[0m[8G[6G[J[0;1;35me[0m[0;1;30mndpoint_add_tcp[0m[7G[6G[J[0m[6G[6G[J[0;1;35me[0m[0;1;30mndpoint_add_tcp[0m[7G[6G[J[0;1;35men[0m[0;1;30mdpoint_add_tcp[0m[8G[6G[J[0;1;35mens[0m[0;1;30mure[0m[9G[6G[J[0;1;35mensu[0m[0;1;30mre[0m[10G[6G[J[0;1;35mensur[0m[0;1;30me[0m[11G[6G[J[0;1;35mensure[0m[12G[6G[J[0;1;35mensure[0m [0m[0;1;30mbaseevents[0m[13G[6G[J[0;1;35mensure[0m m[0m[0;1;30mapmanager[0m[14G[6G[J[0;1;35mensure[0m mk[0m[0;1;30mframe-connect[0m[15G[6G[J[0;1;35mensure[0m mkf[0m[0;1;30mrame-connect[0m[16G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[97mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[97mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[97mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[97mnull
[38;5;66m[script:mkframe-conne] [0m[97msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m oxmysql[0m[20G[6G[J[0;1;35mrestart[0m mkframe-connect[0m[29G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mrefresh[0m[13G
[38;5;73m[ citizen-server-impl] [0m[97m[32mScanning resources.[0m
[38;5;163m[    c-resources-core] [0m[0mResource loading for node_modules failed:
[38;5;163m[    c-resources-core] [0m[0mCould not open resource metadata file - no such file.
[38;5;73m[ citizen-server-impl] [0m[0m[32mFound 1 new resources, and refreshed 0/27 resources.[0m
cfx> [6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mrefresh[0m[13G
[38;5;73m[ citizen-server-impl] [0m[0m[32mScanning resources.[0m
[38;5;163m[    c-resources-core] [0m[0mResource loading for node_modules failed:
[38;5;163m[    c-resources-core] [0m[0mCould not open resource metadata file - no such file.
[38;5;73m[ citizen-server-impl] [0m[0m[32mFound 1 new resources, and refreshed 0/27 resources.[0m
cfx> [6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mrefresh[0m[13G
[38;5;73m[ citizen-server-impl] [0m[0m[32mScanning resources.[0m
[38;5;163m[    c-resources-core] [0m[0mResource loading for node_modules failed:
[38;5;163m[    c-resources-core] [0m[0mCould not open resource metadata file - no such file.
[38;5;73m[ citizen-server-impl] [0m[0m[32mFound 1 new resources, and refreshed 0/27 resources.[0m
cfx> [6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;73m[ citizen-server-impl] [0m[0mserver thread hitch warning: timer interval of 164 milliseconds
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma Steama.
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0m[91mError: Unhandled promise failure: Error: No such export toJSON in resource oxmysql
[38;5;66m[script:mkframe-conne] [0m[91m    at Object.get (citizen:/scripting/v8/main.js:549:15)
[38;5;66m[script:mkframe-conne] [0m[91m    at JSON.stringify (<anonymous>)
[38;5;66m[script:mkframe-conne] [0m[91m    at formatValue (citizen:/scripting/v8/console.js:118:32)
[38;5;66m[script:mkframe-conne] [0m[91m    at format (citizen:/scripting/v8/console.js:167:20)
[38;5;66m[script:mkframe-conne] [0m[91m    at Console.log (citizen:/scripting/v8/console.js:268:25)
[38;5;66m[script:mkframe-conne] [0m[91m    at @mkframe-connect/server.js:49:17
[38;5;66m[script:mkframe-conne] [0m[91m    at process.runNextTicks [as _tickCallback] (node:internal/process/task_queues:61:5)
[38;5;66m[script:mkframe-conne] [0m[91m    at onTick (citizen:/scripting/v8/timer.js:227:28)
[38;5;66m[script:mkframe-conne] [0m[91m    at citizen:/scripting/v8/timer.js:270:13
[38;5;66m[script:mkframe-conne] [0m[91m    at Number.__cfx_wrap_27 (citizen:/scripting/v8/main.js:23:12)[0m
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mnull
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m{
[38;5;66m[script:mkframe-conne] [0m[0m  "id": 1,
[38;5;66m[script:mkframe-conne] [0m[0m  "steam": "steam:11000010f1ed1a7",
[38;5;66m[script:mkframe-conne] [0m[0m  "ban": null,
[38;5;66m[script:mkframe-conne] [0m[0m  "lastJoin": null
[38;5;66m[script:mkframe-conne] [0m[0m}
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mundefined
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m[91mError: Unhandled promise failure: TypeError: odp.length is not a function
[38;5;66m[script:mkframe-conne] [0m[91m    at @mkframe-connect/server.js:48:25
[38;5;66m[script:mkframe-conne] [0m[91m    at async citizen:/scripting/v8/main.js:482:9[0m
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m[91mError: Unhandled promise failure: SyntaxError: Unexpected token o in JSON at position 1
[38;5;66m[script:mkframe-conne] [0m[91m    at JSON.parse (<anonymous>)
[38;5;66m[script:mkframe-conne] [0m[91m    at @mkframe-connect/server.js:48:26
[38;5;66m[script:mkframe-conne] [0m[91m    at async citizen:/scripting/v8/main.js:482:9[0m
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m{
[38;5;66m[script:mkframe-conne] [0m[0m  "id": 1,
[38;5;66m[script:mkframe-conne] [0m[0m  "steam": "steam:11000010f1ed1a7",
[38;5;66m[script:mkframe-conne] [0m[0m  "ban": null,
[38;5;66m[script:mkframe-conne] [0m[0m  "lastJoin": null
[38;5;66m[script:mkframe-conne] [0m[0m}
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m[91mError: Unhandled promise failure: TypeError: Date.now is not a constructor
[38;5;66m[script:mkframe-conne] [0m[91m    at @mkframe-connect/server.js:48:34
[38;5;66m[script:mkframe-conne] [0m[91m    at async citizen:/scripting/v8/main.js:482:9[0m
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mnull Thu Jul 20 2023 22:19:14 GMT+0200 (Central European Summer Time)
[38;5;66m[script:mkframe-conne] [0m[0msotiio wchodzi na serwer | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mGracz sotiio wyszedÅ‚. (Powod: Disconnected.)
[38;5;66m[script:mkframe-conne] [0m[0m{} Thu Jul 20 2023 22:21:40 GMT+0200 (Central European Summer Time)
[38;5;66m[script:mkframe-conne] [0m[0msotiio wchodzi na serwer | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0mGracz sotiio wyszedÅ‚. (Powod: Disconnected.)
[38;5;66m[script:mkframe-conne] [0m[0m{
[38;5;66m[script:mkframe-conne] [0m[0m  "id": 1,
[38;5;66m[script:mkframe-conne] [0m[0m  "steam": "steam:11000010f1ed1a7",
[38;5;66m[script:mkframe-conne] [0m[0m  "ban": {},
[38;5;66m[script:mkframe-conne] [0m[0m  "lastJoin": null
[38;5;66m[script:mkframe-conne] [0m[0m} {}
[38;5;66m[script:mkframe-conne] [0m[0msotiio wchodzi na serwer | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mserver thread hitch warning: timer interval of 167 milliseconds
cfx> [38;5;66m[script:mkframe-conne] [0m[0mGracz sotiio wyszedÅ‚. (Powod: Disconnected.)
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m[91mError: Unhandled promise failure: TypeError: Cannot read properties of undefined (reading 'steam')
[38;5;66m[script:mkframe-conne] [0m[91m    at @mkframe-connect/server.js:47:16
[38;5;66m[script:mkframe-conne] [0m[91m    at process.runNextTicks [as _tickCallback] (node:internal/process/task_queues:61:5)
[38;5;66m[script:mkframe-conne] [0m[91m    at onTick (citizen:/scripting/v8/timer.js:227:28)
[38;5;66m[script:mkframe-conne] [0m[91m    at citizen:/scripting/v8/timer.js:270:13
[38;5;66m[script:mkframe-conne] [0m[91m    at Number.__cfx_wrap_28 (citizen:/scripting/v8/main.js:23:12)
[38;5;66m[script:mkframe-conne] [0m[91m    at citizen:/scripting/v8/main.js:29:16
[38;5;66m[script:mkframe-conne] [0m[91m    at citizen:/scripting/v8/timer.js:269:16
[38;5;66m[script:mkframe-conne] [0m[91m    at async citizen:/scripting/v8/main.js:482:9[0m
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;73m[ citizen-server-impl] [0m[0mserver thread hitch warning: timer interval of 171 milliseconds
[38;5;66m[script:mkframe-conne] [0m[0m[
[38;5;66m[script:mkframe-conne] [0m[0m  {
[38;5;66m[script:mkframe-conne] [0m[0m    "id": 1,
[38;5;66m[script:mkframe-conne] [0m[0m    "steam": "steam:11000010f1ed1a7",
[38;5;66m[script:mkframe-conne] [0m[0m    "ban": 1689886771000,
[38;5;66m[script:mkframe-conne] [0m[0m    "lastJoin": 0
[38;5;66m[script:mkframe-conne] [0m[0m  }
[38;5;66m[script:mkframe-conne] [0m[0m] {
[38;5;66m[script:mkframe-conne] [0m[0m  "id": 1,
[38;5;66m[script:mkframe-conne] [0m[0m  "steam": "steam:11000010f1ed1a7",
[38;5;66m[script:mkframe-conne] [0m[0m  "ban": 1689886771000,
[38;5;66m[script:mkframe-conne] [0m[0m  "lastJoin": 0
[38;5;66m[script:mkframe-conne] [0m[0m}
[38;5;66m[script:mkframe-conne] [0m[0msotiio nie ma whitelisty | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m1
[38;5;66m[script:mkframe-conne] [0m[0m{
[38;5;66m[script:mkframe-conne] [0m[0m  "id": 1,
[38;5;66m[script:mkframe-conne] [0m[0m  "steam": "steam:11000010f1ed1a7",
[38;5;66m[script:mkframe-conne] [0m[0m  "ban": 1689886771000,
[38;5;66m[script:mkframe-conne] [0m[0m  "lastJoin": 0
[38;5;66m[script:mkframe-conne] [0m[0m} 1689886771000
[38;5;66m[script:mkframe-conne] [0m[0msotiio ma bana a chce wbic lol
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0m1
[38;5;66m[script:mkframe-conne] [0m[0m{
[38;5;66m[script:mkframe-conne] [0m[0m  "id": 1,
[38;5;66m[script:mkframe-conne] [0m[0m  "steam": "steam:11000010f1ed1a7",
[38;5;66m[script:mkframe-conne] [0m[0m  "ban": 1689886771000,
[38;5;66m[script:mkframe-conne] [0m[0m  "lastJoin": 0
[38;5;66m[script:mkframe-conne] [0m[0m} 1689886771000
[38;5;66m[script:mkframe-conne] [0m[0msotiio ma bana a chce wbic lol
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0msotiio ma bana a chce wbic lol
[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-connect
[38;5;161m[    c-scripting-core] [0m[0mCreating script environments for mkframe-connect
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-connect
cfx> [38;5;66m[script:mkframe-conne] [0m[0msotiio ma bana a chce wbic lol
[38;5;66m[script:mkframe-conne] [0m[0msotiio ma bana a chce wbic lol
[38;5;66m[script:mkframe-conne] [0m[0msotiio wchodzi na serwer | steam:11000010f1ed1a7
[6G[J[0;1;35mr[0m[0;1;30mateLimiter_getinfo_burst[0m[7G[6G[J[0;1;35mre[0m[0;1;30mfresh[0m[8G[6G[J[0;1;35mref[0m[0;1;30mresh[0m[9G[6G[J[0;1;35mrefr[0m[0;1;30mesh[0m[10G[6G[J[0;1;35mrefre[0m[0;1;30msh[0m[11G[6G[J[0;1;35mrefres[0m[0;1;30mh[0m[12G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mrefresh[0m[13G
[38;5;73m[ citizen-server-impl] [0m[0m[32mScanning resources.[0m
[38;5;163m[    c-resources-core] [0m[0mResource loading for node_modules failed:
[38;5;163m[    c-resources-core] [0m[0mCould not open resource metadata file - no such file.
[38;5;73m[ citizen-server-impl] [0m[0m[32mFound 2 new resources, and refreshed 0/27 resources.[0m
cfx> [6G[J[0;1;35me[0m[0;1;30mndpoint_add_tcp[0m[7G[6G[J[0;1;35men[0m[0;1;30mdpoint_add_tcp[0m[8G[6G[J[0;1;35mens[0m[0;1;30mure[0m[9G[6G[J[0;1;35mensu[0m[0;1;30mre[0m[10G[6G[J[0;1;35mensur[0m[0;1;30me[0m[11G[6G[J[0;1;35mensure[0m[12G[6G[J[0;1;35mensure[0m [0m[0;1;30mbaseevents[0m[13G[6G[J[0;1;35mensure[0m m[0m[0;1;30mapmanager[0m[14G[6G[J[0;1;35mensure[0m mk[0m[0;1;30mframe-connect[0m[15G[6G[J[0;1;35mensure[0m mkf[0m[0;1;30mrame-connect[0m[16G[6G[J[0;1;35mensure[0m mkframe-[0m[0;1;30mconnect[0m[21G[6G[J[0;1;35mensure[0m mkframe-l[0m[0;1;30moadscreen[0m[22G[6G[J[0;1;35mensure[0m mkframe-loadscreen[0m[31G[6G[J[0;1;35mensure[0m mkframe-loadscreen[0m[31G
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-loadscreen
cfx> [38;5;66m[script:mkframe-conne] [0m[0mGracz sotiio wyszedÅ‚. (Powod: Disconnected.)
[38;5;66m[script:mkframe-conne] [0m[0msotiio wchodzi na serwer | steam:11000010f1ed1a7
[6G[J[0;1;35mensure[0m mkframe-loadscreen[0m[31G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mensure[0m mkframe-connect[0m[28G[6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mrefresh[0m[13G
[38;5;73m[ citizen-server-impl] [0m[0m[32mScanning resources.[0m
[38;5;163m[    c-resources-core] [0m[0mResource loading for node_modules failed:
[38;5;163m[    c-resources-core] [0m[0mCould not open resource metadata file - no such file.
[38;5;73m[ citizen-server-impl] [0m[0m[32mFound 1 new resources, and refreshed 1/28 resources.[0m
cfx> [6G[J[0;1;35mrefresh[0m[13G[6G[J[0;1;35mensure[0m mkframe-loadscreen[0m[31G[6G[J[0;1;35mensure[0m mkframe-loadscreen[0m[31G
[38;5;73m[ citizen-server-impl] [0m[0mStopping resource mkframe-loadscreen
[38;5;73m[ citizen-server-impl] [0m[0mStarted resource mkframe-loadscreen
cfx> [38;5;66m[script:mkframe-conne] [0m[0mGracz sotiio wyszedÅ‚. (Powod: Server->client connection timed out. Last seen 393 msec ago.)
[38;5;66m[script:mkframe-conne] [0m[0msotiio wchodzi na serwer | steam:11000010f1ed1a7
[38;5;66m[script:mkframe-conne] [0m[0mGracz sotiio wyszedÅ‚. (Powod: Disconnected.)
[6G[J[0;1;35mq[0m[0;1;30muit[0m[7G[6G[J[0;1;35mqu[0m[0;1;30mit[0m[8G[6G[J[0;1;35mqui[0m[0;1;30mt[0m[9G[6G[J[0;1;35mquit[0m[10G[6G[J[0;1;35mquit[0m[10G
[38;5;186m[ citizen-server-main] [0m[0m-> Quitting: Quit command executed.
cfx> 